// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if(friends.length>=3){
    console.log('Це великий масив в якому 3 і більше елементів')
}else {
    console.log('Це маленький масив в якому менше 3х елементів')
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let A = +prompt('Введи A');
let B = +prompt('Введи B');
let C = +prompt('Введи C');
if (A > B && A < C || A < B && A > C) {
    alert( `Середнім є перше число ${A}`);
} else if (B > A && B < C || B < A && B > C) {
    alert(`Середнім є друге число ${B}`);
} else if (C < B && C > A || C < A && C > B) {
    alert(`Середнім є третє число ${C}`);
} else if (A === B && A === C) {
    alert(`Всі числа рівні. ${A}=${B}=${C}`);
} else if (A === B) {
    alert('Число A = B.');
} else if (A === C) {
    alert('Число A = C');
} else if (B === C) {
    alert('Число B = C');
} else {
    alert('Введи коректні значення');
}

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

(result = (a + b < 4)) ? console.log('Мало') : console.log('Багато');

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let number = +prompt('Введіть число в діапазоні -100...100');
if(number<0&&number>=-100){
    console.log('відємне число')
}else if (number===0){
    console.log('дане число є нулем')
}else if (number>0&&number<=100){
    console.log('додатнє число')
}else {
    console.log('Вводь коректне значення')
}

let number = +prompt('Введіть число в діапазоні -100...100');
(number<0&&number>=-100)?console.log('відємне число'):(number===0)?console.log('дане число є нулем'):(number>0&&number<=100)?console.log('додатнє число'):console.log('Вводь коректне значення')

